application/logs/API/QueryFreeUnit.txt

------>http://10.12.5.205:7080/CRM/CBSInterface_BB_Services
----API: QueryFreeUnit

-------------------Request----->>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bbs="http://www.huawei.com/bme/cbsinterface/bbservices" xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon" xmlns:bbc="http://www.huawei.com/bme/cbsinterface/bbcommon">
   <soapenv:Header/>
   <soapenv:Body>
      <bbs:QueryFreeUnitRequestMsg>
         <RequestHeader>
     <cbs:Version>1</cbs:Version>
	<cbs:BusinessCode>1</cbs:BusinessCode><cbs:MessageSeq>1</cbs:MessageSeq>
	<cbs:OwnershipInfo>
	<cbs:BEID>101</cbs:BEID>
	</cbs:OwnershipInfo>
	<cbs:AccessSecurity>
	<cbs:LoginSystemCode>5060</cbs:LoginSystemCode>
	<cbs:Password>r8q0a5WwGNboj9I35XzNcQ==</cbs:Password>
	</cbs:AccessSecurity>
         </RequestHeader>
         <QueryFreeUnitRequest>
            <bbs:QueryObj>
               <!--You have a CHOICE of the next 3 items at this level-->
             
                 <bbs:SubAccessCode>
                <bbc:PrimaryIdentity>10212648</bbc:PrimaryIdentity>
                 </bbs:SubAccessCode>

          
            </bbs:QueryObj>
           
         </QueryFreeUnitRequest>
      </bbs:QueryFreeUnitRequestMsg>
   </soapenv:Body>
</soapenv:Envelope>


>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>response>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <bbs:QueryFreeUnitResultMsg xmlns:bbs="http://www.huawei.com/bme/cbsinterface/bbservices" xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon">
         <ResultHeader>
            <cbs:Version>1</cbs:Version>
            <cbs:ResultCode>0</cbs:ResultCode>
            <cbs:ResultDesc>Operation successfully.</cbs:ResultDesc>
         </ResultHeader>
         <QueryFreeUnitResult>
            <bbs:FreeUnitItem>
               <bbs:FreeUnitType>Unlimited_CUG</bbs:FreeUnitType>
               <bbs:FreeUnitTypeName>Unlimited CUG</bbs:FreeUnitTypeName>
               <bbs:MeasureUnit>1003</bbs:MeasureUnit>
               <bbs:MeasureUnitName>Seconds</bbs:MeasureUnitName>
               <bbs:TotalInitialAmount>999999</bbs:TotalInitialAmount>
               <bbs:TotalUnusedAmount>999999</bbs:TotalUnusedAmount>
               <bbs:FreeUnitItemDetail>
                  <bbs:FreeUnitInstanceID>702002000109464959</bbs:FreeUnitInstanceID>
                  <bbs:InitialAmount>999999</bbs:InitialAmount>
                  <bbs:CurrentAmount>999999</bbs:CurrentAmount>
                  <bbs:EffectiveTime>20151029000000</bbs:EffectiveTime>
                  <bbs:ExpireTime>20151030000000</bbs:ExpireTime>
                  <bbs:FreeUnitOrigin>
                     <bbs:OriginType>1</bbs:OriginType>
                     <bbs:OfferingKey>
                        <bbs:OfferingID>190853430</bbs:OfferingID>
                        <bbs:PurchaseSeq>520039541643</bbs:PurchaseSeq>
                     </bbs:OfferingKey>
                  </bbs:FreeUnitOrigin>
                  <bbs:RollOverFlag>N</bbs:RollOverFlag>
                  <bbs:LastRollOveredTime>19700101070000</bbs:LastRollOveredTime>
                  <bbs:LastusedTime>20151029002901</bbs:LastusedTime>
               </bbs:FreeUnitItemDetail>
            </bbs:FreeUnitItem>
            <bbs:FreeUnitItem>
               <bbs:FreeUnitType>Free_On_net_Calls</bbs:FreeUnitType>
               <bbs:FreeUnitTypeName>Free On-net Calls</bbs:FreeUnitTypeName>
               <bbs:MeasureUnit>1003</bbs:MeasureUnit>
               <bbs:MeasureUnitName>Seconds</bbs:MeasureUnitName>
               <bbs:TotalInitialAmount>1800</bbs:TotalInitialAmount>
               <bbs:TotalUnusedAmount>1800</bbs:TotalUnusedAmount>
               <bbs:FreeUnitItemDetail>
                  <bbs:FreeUnitInstanceID>702002000109464958</bbs:FreeUnitInstanceID>
                  <bbs:InitialAmount>1800</bbs:InitialAmount>
                  <bbs:CurrentAmount>1800</bbs:CurrentAmount>
                  <bbs:EffectiveTime>20151029000000</bbs:EffectiveTime>
                  <bbs:ExpireTime>20151030000000</bbs:ExpireTime>
                  <bbs:FreeUnitOrigin>
                     <bbs:OriginType>1</bbs:OriginType>
                     <bbs:OfferingKey>
                        <bbs:OfferingID>1786076982</bbs:OfferingID>
                        <bbs:PurchaseSeq>520039541641</bbs:PurchaseSeq>
                     </bbs:OfferingKey>
                  </bbs:FreeUnitOrigin>
                  <bbs:RollOverFlag>N</bbs:RollOverFlag>
                  <bbs:LastRollOveredTime>19700101070000</bbs:LastRollOveredTime>
                  <bbs:LastusedTime>20151029002901</bbs:LastusedTime>
               </bbs:FreeUnitItemDetail>
            </bbs:FreeUnitItem>
         </QueryFreeUnitResult>
      </bbs:QueryFreeUnitResultMsg>
   </soapenv:Body>
</soapenv:Envelope>